module.exports = function (req, res) {
  var obj = {
    2109: ["翟文志", "肖学桐", "许睿", "崔祖坤", "吴彦祖", "安佰鹤", "孙道凯", "刘洋", "张修宝", "王嘉晖", "李令君", "房晓龙", "高尚龙", "石浩", "于鑫超", "倪萌泉", "李延栋", "李沅峰", "王坤", "官政君", "高翔", "郭逸语", "刘金才", "王光宗", "段肖亭", "厉志宝", "吴宜轩", "卢玺", "许宗祥", "郭德乐", "李晏臣",],
    2201: ["孙顺", "陈宇", "孔润龙", "张祥", "孙启涵", "杨福成", "任龙翔", "许晓松", "李晓杰", "高成轩", "周羽鑫", "滕淑曼", "袁梦", "陈晓康", "马淑玲", "丁玉欣", "邵荣鑫", "李杰", "王东", "刘晓伟", "王梓懿", "刘书言", "王晨", "王楠", "安文青", "杨宏", "贾春宝", "苑咸风", "沈泽浩", "高尚龙", "王歧文"],
    2202: ["朱传轲", "王昕昊", "王成斌", "王超智", "严娟", "魏文通", "张文玉", "赵瑛琪", "杨明雨", "王晓雪", "岳文昊", "王石", "栾崇泉", "刘玉", "朱昊", "刘欣武", "孙莹晖", "陈志朋", "邹明琦", "过道", "张彦卓", "商子康", "尚超", "袁瑞", "王文超", "陈贞", "宋欣欣", "祝雪", "马英飞", "乔泽建", "赵晟", "王怀堃", "高楠", "史金昊", "吕晶", "史浩亮"]
  }
  var id = req.query.id;
  var callbackname = req.query.callbackname;
  var arr = obj[id] || [];

  res.setHeader("content-type", "text/plain;charset=utf-8")
  res.send(callbackname +"(" + JSON.stringify({
    error: 0,
    data: arr,
    message: "请求成功",
  })  + ")");
};
